index=main host=WS01 sourcetype="WinEventLog:Security" EventCode=4698
("cmd.exe" OR "powershell" OR "mshta" OR "rundll32" OR "wscript" OR "cscript" OR "\\AppData\\" OR "\\Temp\\")
| table _time, Task_Name
