index=main host=WS01 sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1
CommandLine IN("*whoami*", "*localgroup*", * group *", * user *", *nltest*", *systeminfo*", *ipconfig*" , *arp*", *hostname*", *net view*")
| bin _time span=5m
| stats dc(CommandLine) as distinct_cmds by host, _time
| where distinct_cmds >= 5
