index=main host=WS01 sourcetype="WinEventLog:Security" (EventCode=4720 OR (EventCode=4732 Group_Name="Administrators"))
| rex field=_raw "(?:New Account|Member):\s*\n\s*Security ID:\s+(?<target_sid>S-1-5-21-\S+)"
| stats dc(EventCode) as code_count values(Account_Name) as accounts by target_sid
| where code_count >= 2
