index=main host=WS01 sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=13 TargetObject="*\\Run\\*"
(Details="*\\AppData\\*" OR Details="*\\Temp\\*" OR Details="*\\Users\\Public\\*" OR Details="*\\ProgramData\\*" OR Details="*powershell*" OR Details="*cmd*")
| table _time, Image, TargetObject, Details
